Revit 2027 API
MaterialNode.ThumbnailFile Property
 The path if a file that contains a thumbnail image of the material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ThumbnailFile { get; }
Public ReadOnly Property ThumbnailFile As String
	Get
public:
property String^ ThumbnailFile {
	String^ get ();
}
member ThumbnailFile : string with get
Property Value
String
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace